# カスタムTap
tap "hidari/tap"
tap "stripe/stripe-cli"
tap "supabase/tap"

# --- 開発ツール ---
brew "git"                                # バージョン管理システム
brew "cmake"                              # クロスプラットフォームビルドシステム
brew "icu4c@76"                           # C/C++向けUnicode,国際化,地域化ライブラリ
brew "go"                                 # Go言語
brew "deno"                               # Denoランタイム
brew "gh"                                 # GitHub CLI
brew "libpq"                              # PostgreSQL通信するクライアントライブラリ

# --- Platform CLI
brew "stripe/stripe-cli/stripe"           # Stripe決済プラットフォームCLI
brew "supabase/tap/supabase"              # SupabaseバックエンドサービスCLI
brew "awscli"                             # AWS CLIツール
brew "cloudflared"                        # Cloudflare TunnelのCLI
brew "cloud-sql-proxy"                    # Google Cloud SQLプロキシ
cask "gcloud-cli"                         # Google Cloud Platform CLI
cask "1password-cli"                      # 1Passwordコマンドラインツール

# --- メディア処理 ---
brew "ffmpeg"                             # 動画・音声変換ツール
brew "imagemagick"                        # 画像処理ツール
brew "yt-dlp"                             # 動画ダウンローダー

# --- ユーティリティ ---
brew "jq"                                 # JSONパーサー
brew "rsync"                              # ファイル同期ツール
brew "tree"                               # ディレクトリツリー表示
brew "hidari/tap/rip"                     # zipアーカイバ

# --- Go言語ツール ---
go "golang.org/x/tools/gopls"             # Go言語サーバー（LSP）
go "honnef.co/go/tools/cmd/staticcheck"   # Go静的解析ツール
